Enums/ВидыДеятельностиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДеятельностиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Облагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необлагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОблагаемая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УчетНДС/Ext/Module.bsl
// Определяет, есть ли право на налоговый кредит
//
Функция ЕстьПравоНаНалоговыйКредит(НалоговоеНазначение) Экспорт
	       
	// Право на налоговый кредит дается только, если
	//		приобретаемые ценности будут использоваться в хозяйственной деятельности
	//			в облагаемых НДС операциях
	
	Если НалоговоеНазначение = Неопределено ИЛИ
		 (НалоговоеНазначение.ВидНалоговойДеятельности = Справочники.ВидыНалоговойДеятельности.НеОблагаемая) ИЛИ
		 (НалоговоеНазначение.ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЕстьНалоговыйКредит()

//Возвращает вид деятельности по НДС по ставке НДС
//
Функция ПолучитьВидДеятельностиНДС(СтавкаНДС, ДопПараметры = Неопределено) Экспорт
	
	ЕстьДопПараметры = (ТипЗнч(ДопПараметры) = Тип("Структура"));
	
	Если ЕстьДопПараметры Тогда
		
		Если ДопПараметры.Свойство("БартерИЭкспорт") Тогда
			Если ДопПараметры.БартерИЭкспорт = Истина Тогда
			    
				// Вообще-то это "временное" ограничение. Но продлевается
				// каждый год начиная с 2001-го: дату проверки не учитываем
				Возврат Перечисления.ВидыДеятельностиНДС.Необлагаемая;
				
			КонецЕсли; 
		//ИначеЕсли	
		КонецЕсли;
		
	КонецЕсли;	//ЕстьДопПараметры
	
	// по общим правилам
	Если     СтавкаНДС = Перечисления.СтавкиНДС.НДС20 
		 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС0 
		 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС7 
		 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС14
		 Тогда
		 
		Возврат Перечисления.ВидыДеятельностиНДС.Облагаемая;
	Иначе
		
		Возврат Перечисления.ВидыДеятельностиНДС.Необлагаемая;
	КонецЕсли; 
	
КонецФункции // ПолучитьВидДеятельностиНДС()
	
//Возвращает параметры налогового учета на Дату
Функция ПолучитьПараметрыНалоговогоУчета(Дата) Экспорт
	
	ПараметрыНУ = РегистрыСведений.ПараметрыНалоговогоУчета.ПолучитьПоследнее(Дата);
	Возврат ПараметрыНУ;
		
КонецФункции // ПолучитьПараметрыНалоговогоУчета()

// Рассчитываем сумму НДС документа
//
// Параметры: 
//  ДокументОбъект    - объект документа, сумму которого надо рассчитать
//  ИмяТабличнойЧасти - строка, имя табличной части, сумму которой надо рассчитать.
//                      Если она не заполнена, считаем по всем табличным частям, в которых есть "Сумма"
//
// Возвращаемое значение:
//  НДС документа
//
Функция ПолучитьНДСДокумента(ДокументОбъект, ИмяТабличнойЧасти = Неопределено) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	СуммаНДС = 0;
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		СуммаНДС = СуммаНДС + ДокументОбъект[ИмяТабличнойЧасти].Итог("СуммаНДС");
	Иначе
		Для каждого ТЧОбъекта Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ТЧОбъекта.Имя) Тогда
				СуммаНДС = СуммаНДС + ДокументОбъект[ТЧОбъекта.Имя].Итог("СуммаНДС");
			КонецЕсли;
		КонецЦикла;
		
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаНДС", МетаданныеДокумента) Тогда
			СуммаНДС = СуммаНДС + ДокументОбъект.СуммаНДС;
		КонецЕсли;
		
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // ПолучитьНДСДокумента()

// Рассчитываем сумму документа со всеми налогами
//
// Параметры: 
//  ДокументОбъект    - объект документа, сумму которого надо рассчитать
//  ИмяТабличнойЧасти - строка, имя табличной части, сумму которой надо рассчитать.
//                      Если она не заполнена, считаем по всем табличным частям, в которых есть "Сумма"
//  НеУчитыватьТару   - булево, если Истина и ИмяТабличнойЧасти неопределено, то в расчете сумм тару не учитываем
//
// Возвращаемое значение:
//  Сумма документа со всеми налогами.
//
Функция ПолучитьСуммуДокументаСНДС(ДокументОбъект, ИмяТабличнойЧасти = Неопределено, НеУчитыватьТару = Истина) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	СуммаДокумента = 0;
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("Сумма");
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
		   И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
		   И ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ИмяТабличнойЧасти)
		   И ДокументОбъект.УчитыватьНДС
		   И Не ДокументОбъект.СуммаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("СуммаНДС");
		КонецЕсли; 
	Иначе
		Для каждого ТЧОбъекта Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			Если НеУчитыватьТару и ТЧОбъекта.Имя = "ВозвратнаяТара" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ВыданныеАвансы" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ДокументыРасчетовСКонтрагентом" Тогда
				Продолжить;
			КонецЕсли;
			Если ТЧОбъекта.Имя = "ДенежныеСредства" Тогда
				Продолжить;
			КонецЕсли;			
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Сумма", МетаданныеДокумента, ТЧОбъекта.Имя) Тогда
				СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("Сумма");
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
					И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
					И ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ТЧОбъекта.Имя)
					И ДокументОбъект.УчитыватьНДС
					И Не ДокументОбъект.СуммаВключаетНДС Тогда
					СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("СуммаНДС");
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Сумма", МетаданныеДокумента) Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект.Сумма;
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
				И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
				И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаНДС", МетаданныеДокумента)
				И ДокументОбъект.УчитыватьНДС
				И Не ДокументОбъект.СуммаВключаетНДС Тогда
				СуммаДокумента = СуммаДокумента + ДокументОбъект.СуммаНДС;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	Возврат СуммаДокумента;

КонецФункции // ПолучитьСуммуДокументаСНДС()

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если (УчитыватьНДС) И (СуммаВключаетНДС) Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если УчитыватьНДС Тогда 
		Если НЕ СуммаВключаетНДС Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 20;
	КонецЕсли;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат 7;
	КонецЕсли;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС14 Тогда
		Возврат 14;
	КонецЕсли;

	Возврат 0;

КонецФункции // ПолучитьСтавкуНДС()

// Функция производит поиск документа заданного вида, имеющего значение реквизита "ДокументОснование", равное
// переданной ссылке.
//
// Параметры:
//  ДокументСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидСчетаФактуры - строка, вид документа, по умолчанию "СчетФактураВыданный"
//
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено
//
Функция НайтиПодчиненныйДокумент(ДокументСсылка, ВидДокумента) Экспорт

	НайденныйДокумент = Неопределено;

	Если ЗначениеЗаполнено(ДокументСсылка) Тогда

		Запрос = Новый Запрос;

		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка 
		|ИЗ
		|	Документ." + ВидДокумента + "
		|
		|ГДЕ
		|	ДокументОснование = &ДокументСсылка";

		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

		Если ВыборкаИзЗапроса.Следующий() Тогда
			НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Возврат НайденныйДокумент;

КонецФункции // НайтиПодчиненныйДокумент()

//Преименование колонок таблицы значений по данным соответствия
Процедура ПереименованиеКолонок(ТаблицаЗначений, СоответствиеНазваний, Обратное = Ложь, СообщатьОбОшибке = Истина) Экспорт
	
	Колонки = ТаблицаЗначений.Колонки;
	
	Для каждого Колонка Из СоответствиеНазваний Цикл
		Если Обратное Тогда
			СтароеНазвание = Колонка.Значение;
			НовоеНазвание =  Колонка.Ключ;
		Иначе
			СтароеНазвание = Колонка.Ключ;
			НовоеНазвание =  Колонка.Значение;
		КонецЕсли;
		Если Колонки.Найти(СтароеНазвание) = неопределено тогда
			Если СообщатьОбОшибке Тогда
			    ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='При переименовании колонок таблиццы не обнаружена колонка с именем ""%1""! Переименование колонки не произведено.';uk='При перейменуванні колонок таблиці не виявлено колонки з ім''ям ""%1""! Перейменування колонки не зроблено.'"), СтароеНазвание));
			КонецЕсли; 
		ИначеЕсли не Колонки.Найти(НовоеНазвание) = неопределено тогда
			Если СообщатьОбОшибке Тогда
			    ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='При переименовании колонок таблиццы обнаружена колонка с именем ""%1"", переименование существующей колонки ""%2"" невозможно! Переименование колонки не произведено.';uk='При перейменуванні колонок таблиці виявлена колонка з ім''ям ""%1"", перейменування існуючої колонки ""%2"" неможливо! Перейменування колонки не зроблено.'"), НовоеНазвание, СтароеНазвание));
			КонецЕсли; 
		Иначе
			Колонки[СтароеНазвание].Имя = НовоеНазвание;
		КонецЕсли;
	КонецЦикла; 
	

КонецПроцедуры

// Преобразует таблицу значений в дерево значений, группируя значения по колонкам, формирование итога по строкам
Функция ТаблицуЗначенийВДеревоСГруппировкой(ТаблицаРезультатов, знач ГруппировочныеКолонки= "",знач КолонкиИтогов = "") экспорт
	
	ДеревоРезультатов  = Новый ДеревоЗначений();
	Для каждого Колонка из ТаблицаРезультатов.Колонки Цикл
		ДеревоРезультатов.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения,Колонка.Заголовок,Колонка.Ширина);
	КонецЦикла; 
	
	Если ПустаяСтрока(ГруппировочныеКолонки) Тогда
		Для каждого СтрокаТаблицы Из ТаблицаРезультатов Цикл
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
			Для каждого Колонка из ДеревоРезультатов.Колонки Цикл
				СтрокаДерева[Колонка.Имя] = СтрокаТаблицы[Колонка.Имя]
			КонецЦикла; 
		КонецЦикла; 
		
		Возврат ДеревоРезультатов;
	КонецЕсли;
	
	ТаблицаГруппировок = ТаблицаРезультатов.Скопировать();
	ТаблицаГруппировок.Свернуть(ГруппировочныеКолонки,КолонкиИтогов);

	Для каждого СтрокаТаблицы Из ТаблицаГруппировок Цикл
		СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
		Для каждого Колонка из ТаблицаГруппировок.Колонки Цикл
			СтрокаДерева[Колонка.Имя] = СтрокаТаблицы[Колонка.Имя]
		КонецЦикла; 
	КонецЦикла; 
	
	ЗначенияОтбора = Новый Структура(ГруппировочныеКолонки);
	Для каждого СтрокаДерева из  ДеревоРезультатов.Строки Цикл
		//Формирование структуры отбора
		Для каждого ПараметрОтбора Из ЗначенияОтбора Цикл
			ЗначенияОтбора.Вставить(ПараметрОтбора.Ключ, СтрокаДерева[ПараметрОтбора.Ключ]);
		КонецЦикла; 
		
		//Поиск и заполнение подчиненными колонками
		МассивПодчиненныйхСтрок = ТаблицаРезультатов.НайтиСтроки(ЗначенияОтбора);
		Для каждого СтрокаТаблицы Из МассивПодчиненныйхСтрок Цикл
			ПодчиненнаяСтрокаДерева = СтрокаДерева.Строки.Добавить();
			Для каждого Колонка из ДеревоРезультатов.Колонки Цикл
				ПодчиненнаяСтрокаДерева[Колонка.Имя] = СтрокаТаблицы[Колонка.Имя];
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
		
	Возврат ДеревоРезультатов;
КонецФункции

//Удалает повторяющиеся элементы массива.
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено = Ложь) Экспорт
	
	ОписаниеТиповСправочники  = Справочники.ТипВсеСсылки(); 
	ОписаниеТиповДокументы    = Документы.ТипВсеСсылки(); 
	ОписаниеТиповПВХ          = ПланыВидовХарактеристик.ТипВсеСсылки(); 

	Если ТипЗнч(Массив) = Тип("Массив") Тогда 
		
		УжеВМасссиве = Новый Соответствие; 
		БылоНеопределено = Ложь;
		
		КолвоЭлементовВМассиве = Массив.Количество(); 
		
		Для ОбратныйИндекс = 1 По КолвоЭлементовВМассиве Цикл 
			ЭлементМассива = Массив[КолвоЭлементовВМассиве - ОбратныйИндекс]; 
			ТипЭлемента = ТипЗнч(ЭлементМассива); 
			Если ЭлементМассива = Неопределено Тогда
				Если БылоНеопределено или НеИспользоватьНеопределено Тогда
					Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс); 
				Иначе
					БылоНеопределено = Истина;
				КонецЕсли;
				Продолжить;
			ИначеЕсли ОписаниеТиповСправочники.СодержитТип(ТипЭлемента) 
				ИЛИ ОписаниеТиповДокументы.СодержитТип(ТипЭлемента) 
				ИЛИ ОписаниеТиповПВХ.СодержитТип(ТипЭлемента) Тогда
				
				ИДЭлемента = Строка(ЭлементМассива.УникальныйИдентификатор()); 
				
			Иначе 
				
				ИДЭлемента = ЭлементМассива; 
				
			КонецЕсли; 
			
			Если УжеВМасссиве[ИДЭлемента] = Истина Тогда 
				Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс); 
			Иначе 
				УжеВМасссиве[ИДЭлемента] = Истина; 
			КонецЕсли; 
		КонецЦикла;      
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокВыбораСпецРежимНалогообложения() Экспорт
	
	мСписокВыбораСпецРежимНалогообложения = Новый СписокЗначений();
	мСписокВыбораСпецРежимНалогообложения.Добавить(0, "0   спец. режим не застосовується");
	мСписокВыбораСпецРежимНалогообложения.Добавить(2, "2 Платники, включені до реєстру отримувачів бюджетної дотації.
														|До 01.03.2017: сільськогосподарські підприємства, які застосовують
														|спеціальний режим оподаткування діяльності у сфері сільського та 
														|лісового господарства, а також рибальства відповідно до статті 209 Кодексу");
	мСписокВыбораСпецРежимНалогообложения.Добавить(3, "(до 01.01.2017) 3 сільськогосподарські підприємства усіх форм власності,
														|які відповідають критеріям, визначеним статтею 209 Кодексу ,
														|але які не обрали спеціальний режим оподаткування 
														|діяльності у сфері сільського, лісового господарства та рибальства 
														|та реалізують молоко, худобу, птицю, вовну власного виробництва, а 
														|також молочні продукти, молочну сировину та м'ясопродукти, 
														|вироблені у власних переробних цехах");
	мСписокВыбораСпецРежимНалогообложения.Добавить(4, "4 (до 01.01.2015) переробні підприємства усіх форм власності, які згідно з 
														|пунктом 1 підрозділу 2 розділу XX Кодексу за 
														|реалізовані ними молоко, молочну сировину та молочні продукти, 
														|м'ясо та м'ясопродукти, іншу продукцію переробних тварин, 
														|закуплених у живій вазі (шкури, субпродукти, м'ясо-кісткове 
														|борошно), у повному обсязі спрямовують суми податку на додану 
														|вартість до спеціального фонду державного бюджету");
	мСписокВыбораСпецРежимНалогообложения.Добавить(6, "6 складання податкової накладної для операцій з постачання товарів,
														|базою оподаткування для яких встановлено максимальні роздрібні ціни");
														
	Возврат мСписокВыбораСпецРежимНалогообложения;														

КонецФункции // ()

Функция КодЕдиницыИзмеренияДляПечатиНалоговых(Код) Экспорт

	Код = СтрЗаменить(Строка(Код), " ", "");
	
	Если НЕ СтрДлина(Код) = 4 Тогда
	
		Возврат "";	
		
	Иначе
		
		Для НомСимв = 1 По 4 Цикл
			КодСимвола = КодСимвола(Код, НомСимв);
			Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
				Возврат "";
			КонецЕсли; 
		КонецЦикла; 		
		
		Возврат Код;
		
	КонецЕсли;	

КонецФункции

Функция РазрешенаВыгрузкаПечатьНалоговогоДокумента(ДокументОбъект) Экспорт
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции
